package com.ct.tribe.constants;

public interface HeroConstants {
    String[] LAST_NAME = {"慕容", "李", "张", "刘", "诸葛", "陈", "杨", "龙", "马", "王", "孟", "乌", "井", "裴", "陆", "左", "程", "贾", "崔", "赵", "周", "吴", "郑", "沈", "蒋", "韩", "关", "朱", "凌", "霍", "公孙", "司空", "司徒", "上官", "萧"};
    String[] FIRST_NAME_MALE = {"庞", "仲伯", "霸天", "子", "龙", "宇辰", "玮", "帝", "洪", "逸星", "涛", "杰伦", "霆锋", "赫", "国国", "羽", "备", "飞", "子龙", "嘉林", "峰", "三丰", "傲天", "于晏", "勇", "权", "坚", "亮", "刚", "子文", "子若", "子墨", "墨", "恒", "家博", "弘", "辉", "东", "西", "南", "北", "杰", "俊杰", "冉", "以太", "帅"};
    String[] FIRST_NAME_FEMALE = {"雨曦", "月光", "蔓", "婵", "嘉欣", "雯雯", "诺", "诗雨", "欣茹", "美娟", "琳", "微", "薇", "子涵", "菲", "菲菲", "嘉怡", "燕", "妙曼", "蔓蔓", "玉", "桂花", "梓蓉", "珂", "安怡", "慧馨", "慧昕", "慧欣", "花花", "晓丽", "梓彤", "晓欣", "亦舒", "紫萱", "亚轩", "霏霏", "妍文", "子涵", "幂", "芮"};

    int MAX_MALE_AVATAR = 32;
    int MAX_FEMALE_AVATAR = 25;
    int MAX_OTHER_AVATAR = 6;

    /**
     * 初始化英雄时默认的总属性点
     */
    int DEFAULT_PROPS = 200;
}
